let knowledge = [
  ["магнитные свойства", "обусловлены", "движением электрических зарядов."],
  [
    "магнитный момент электронной оболочки",
    "определяет",
    "магнитные свойства атома.",
  ],
  [
    "магнитная восприимчивость",
    "- это",
    "отношение намагниченности к напряженности магнитного",
  ],
  [
    "магнитная восприимчивость",
    "оценивает",
    "силу взаимодействия вещества с магнитным полем.",
  ],
  [
    "магнитная восприимчивость",
    "растет",
    "с увеличением напряжённости поля, пока не достигает некоего максимума, после чего вновь уменьшается.",
  ],
  [
    "кривая Столетова",
    "- это",
    "график зависимости магнитной восприимчивости от напряжённости магнитного поля в ферромагнетике.",
  ],
  [
    "дифференциальная магнитная восприимчивость",
    "равнат",
    "производной намагниченности единицы объёма вещества по напряжённости поля.",
  ],
  [
    "закон Кюри — Вейса",
    "описывает",
    "магнитную восприимчивость ферромагнетика в области температур выше точки Кюри",
  ],
  [
    "существование постоянных магнитов",
    "объясняется",
    "магнитным гистерезисом.",
  ],
  [
    "гистерезис",
    "используется",
    "для подавления шумов (быстрых колебаний, дребезга контактов) в момент переключения логических сигналов.",
  ],
  [
    "эффект Гопкинса",
    "заключается",
    "в том, что при нагреве ферромагнетика до температуры, близкой к точке Кюри, его магнитная восприимчивость усиливается за счёт снижения трения ферромагнитных доменов, облегчается поворот ферромагнитных доменов во внешнем магнитном поле.",
  ],
  [
    "все вещества по силе взаимодействия",
    "разделяются",
    "на сильномагнитные и слабомагнитные.",
  ],
  [
    "ферромагнетики",
    "- это",
    "вещества, которые могут обладать спонтанной намагниченностью, т. е. намагничены уже при отсутствии внешнего магнитного поля.",
  ],
  [
    "намагниченность ферромагнетиков",
    "превосходит",
    "в огромное (до 10<sup>10</sup>) число раз намагниченность диа- и парамагнетиков",
  ],
  [
    "ферромагнитными свойствами ",
    "обладают",
    " Fe, Co, Ni, Gd, Dy, Tb, Ho, Er, Tm",
  ],
  [
    "сплавы Гейслера",
    "- это",
    " ферромагнитные металлические сплавы, компоненты которых сами по себе не являются ферромагнитными.",
  ],
  [
    "сплавы Гейслера",
    "названы",
    "в честь в честь немецкого горного инженера Фрица Хейслера, изучавшего такой сплав в 1903 году.",
  ],
  [
    "аморфные ферромагнитные сплавы",
    "можно получить",
    "путем быстрой закалки жидкого сплава.",
  ],
  [
    "типичным аморфным ферромагнитным сплавом",
    "является",
    "сплав состоящий из переходного металла и металлоидов.",
  ],
  ["металлоидный компонент", "снижает", "температуру плавления."],
  [
    "преимущество аморфных сплавов",
    "состоит",
    "в том что их свойсва почти изотропны.",
  ],
  [
    "постоянные магниты",
    "- это",
    "тела, способные сохранять намагниченность на протяжении длительного времени.",
  ],
  [
    "диамагнетики",
    "- это",
    "вещества, намагничивающиеся против направления внешнего магнитного поля. ",
  ],
  [
    "парамагнетики",
    "- это",
    "вещества, которые намагничиваются во внешнем магнитном поле в направлении внешнего магнитного поля (J↑↑H) и имеют положительную магнитную восприимчивость, но значительно меньшую единицы.",
  ],
  ["диамагнетики", "относятся", "к слабомагнитным веществам."],
  ["парамагнетики", "относятся", "к слабомагнитным веществам."],
  ["антиферромагнетики", "относятся", "к слабомагнитным веществам."],
  ["ферромагнетики", "относятся", "к сильномагнитным веществам."],
  ["ферримагнетики", "относятся", "к сильномагнитным веществам."],
  [
    "характерной особенностью ферромагнетиков",
    "явялется",
    "сложная нелинейная зависимость намагниченности J от напряженности H магнитного поля <br><img class='question-img' src='../assets/img/main_curve.jpg'/>",
  ],
  [
    "явление магнитного насыщения",
    "обнаружено",
    "Александром Григорьевичем Столетовым в 1872 г.",
  ],
  [
    "магнитная индукция в веществе",
    "равна",
    "B = μ<sub>0</sub>H + μ<sub>0</sub>Jю",
  ],
  ["максимальная магнитная проницаемость чистого железа", "равна", "5000."],
  [
    "максимальная магнитная проницаемость чистого молибденового пермаллоя",
    "равна",
    "150 000ю",
  ],
  [
    "магнитный гистерезис",
    "- это",
    "неоднозначная зависимость вектора магнитной индукции от напряженности внешенего магнитного поля, которая определяется предысторией намагничивания образца ферромагнетика.",
  ],
  [
    "остаточная намагниченность",
    "- это",
    "намагниченность M, которой обладает ферромагнитный материал при нулевой напряжённости внешнего магнитного поля H.",
  ],
  [
    "коэрцитивная сила",
    "- это",
    "это значение напряжённости внешнего магнитного поля, необходимое для полного размагничивания ферро- или ферримагнитного вещества.",
  ],
  [
    "петля гистерезиса",
    "- это",
    "кривая изменения индукции магнитного поля В в ферромагнетике в зависимости от изменения напряженности внешнего магнитного поля Н.",
  ],
  [
    "постоянный магнит",
    "сохряняет",
    "свои свойства лучше, чем больше коэрцитивная сила материала, из которого он изготовлен.",
  ],
  ["ферромагнетики", "делятся", "на жесткие и мягкие."],
  ["ферромагнетики с малой коэрцитивной силой", "называются", "мягкими"],
  ["ферромагнетики с большой коэрцитивной силой", "называются", "жесткими"],
  [
    "жесткие ферромагнетики",
    "используют",
    "для изготовления постоянных магнитов.",
  ],
  [
    "мягкие ферромагнетики",
    "используют",
    "для изготовления сердечников трансформаторов",
  ],
  [
    "магнитомягкие материалы",
    "можно разделить",
    "на следующие группы: технически чистое железо (низкоуглеродистая сталь); кремнистая электротехническая сталь; сплавы с высокой начальной магнитной проницаемостью (пермаллои); сплавы с большой индукцией насыщения (пермендюр); ферриты.",
  ],
  [
    "опытами Эйнштейна - де Газа и Барнетта",
    "доказано",
    "что ферромагнетизм связан с упорядочением спиновых магнитных моментов атомов.",
  ],
  [
    "спины электронов",
    "стремятся",
    "ориентироваться в одном направлении при отсутствии внешних магнитных полей.",
  ],
  [
    "спиновые магнитные моменты",
    "ориентируются",
    "в противоположном спинам электронов направлении.",
  ],
  ["образец", "разбивается", "на домены."],
  [
    "домены",
    "- это",
    "малые макроскопические области спонтанного, т. е. самопроизвольного, намагничивания.",
  ],
  ["домены", "содержат", "большое число атомов."],
  [
    "спиновые магнитные моменты электронов в пределах одного домена",
    "ориентированы",
    "одинаковою",
  ],
  [
    "возникновение доменной структуры",
    "соответсвует",
    "минимуму энергии телаю",
  ],
  ["размеры доменов", "находятся", "в пределах от 1 мкм до 10–2 см."],
  [
    "магнитные моменты различных доменов",
    "ориентированы",
    "беспорядочно при отсутствии внешнего магнитного поляю",
  ],
  ["тело", "не намагничивается", "при отсутствии внешнего магнитного поляю"],
  [
    "домены",
    "увеличиваются",
    "в объеме с появлением внешнего магнитного поля за счет соседних доменов, имеющих иные ориентации магнитных моментовю",
  ],
  [
    "ферромагнетик",
    "намагничивается",
    "с появлением внешнего магнитного поляю",
  ],
  [
    "обратимый рост границ доменов",
    "происходит",
    "при увеличении напряженности внешнего поля.",
  ],
  [
    "необратимый рост границ доменов",
    "происходит",
    "при возрастании напряженности внешнего поля ",
  ],
  [
    "переворачивание доменов",
    "происходит",
    "в направлении внешнего поля после необратимого роста границ доменов.",
  ],
  [
    "все домены",
    "ориентируются",
    "в направлении поля при достаточно сильных полях.",
  ],
  ["намагничивание", "насыщается", "при достаточно сильных полях."],
  [
    "ферромагнетик",
    "является",
    "одним монодоменом, если все домены ориентированы в направлении поля.",
  ],
  [
    "тепловое движение",
    "не разрушает",
    "преимущественную ориентацию доменов полностью при выключении внешнего поля.",
  ],
  [
    "ферромагнетики",
    "не размагничиваются",
    "полностью при выключении внешнего поля.",
  ],
  [
    "ферромагнетики",
    "сохраняют",
    "остаточную индукцию (намагниченность) при выключении внешнего поля.",
  ],
  [
    "способность ферромагнетиков намагничиваться",
    "уменьшается",
    "при повышении температуры.",
  ],
  [
    "определенная температура",
    "имеется",
    "для каждого ферромагнетика, при которой происходит разрушение доменной структуры и вещество теряет ферромагнитные свойства.",
  ],
  [
    "разрушение доменной структуры",
    "происходит",
    "при определенной температуре.",
  ],
  [
    "вещество",
    "теряет",
    "ферромагнитные свойства при определенной температуре.",
  ],
  [
    "точка Кюри",
    "- это",
    "определенная температура, при которой происходит разрушение доменной структуры и вещество теряет ферромагнитные свойства.",
  ],
  [
    "тепловое движение молекул",
    "становится",
    "достаточно интенсивным, чтобы разрушить домены при нагревании ферромагнетика до точки Кюри.",
  ],
  [
    "спонтанная намагниченность",
    "исчезает",
    "при нагревании ферромагнетика до точки Кюри.",
  ],
  [
    "ферромагнетик",
    "ведет",
    "себя как обычный парамагнетик при нагревании ферромагнетика до точки Кюри.",
  ],
  [
    "переход через точку Кюри",
    "не сопровождается",
    "выделением или поглощением теплоты.",
  ],
  ["переход через точку Кюри", "является", "фазовым переходом второго рода."],
  [
    "аномалии",
    "наблюдаются",
    "в точке Кюри, такие как: исчезновение ферромагнитных свойств у вещества, аномалия в ходе теплоемкости, электропроводности и т. д",
  ],
  [
    "число витков на единицу длины",
    "равно",
    "<br><img class='question-img' src='..//assets/img/чило витков на единицу длины.jpg'/> <br>где N1 − полное число витков обмотки 1, a - средний радиус.",
  ],
  [
    "молибденовый пермаллой",
    "является",
    "сплавом 79% никеля, 17% железа и 4% молибдена.",
  ],
  [
    "напряженность магнитного поля катушки",
    "равна",
    "<br><img class='question-img' src='..//assets/img/напряженность магнитного поля.jpg'/> <br>где N1 − полное число витков обмотки 1, a - средний радиус.",
  ],
  [
    "горизонтальная развертка луча осциллографа",
    "осуществляется",
    "напряжением.",
  ],
  [
    "напряжение",
    "пропорционально",
    "мгновенному значению напряженности H(t) намагничивающего поля в сердечнике.",
  ],
  ["ЭДС индукции", "пропорциональна", "скорости изменения магнитного потока."],
  ["напряжение на конденсаторе", "пропорционально", "индукции B"],
  ["напряжение на конденсаторе", "подается", "на вход Y осциллографа."],
  [
    "значение напряжений U1 и UC",
    "определяются",
    "по размахам X и Y отклонений луча на экране осциллографа",
  ],
  [
    "напряжение U1",
    "равно",
    "<br><img class='question-img' src='..//assets/img/48-6.jpg'/> <br> где δX и δY − чувствительности горизонтального и вертикального отклонений осциллографа; Х и Y − число делений на шкалах экрана, соответствующее размаху луча по осям OХ или OY в обе стороны, т. е. вершинам А1 и А2 петли.",
  ],
  [
    "значения параметров, необходимых для расчетов,",
    "указаны",
    "в приложении к установке.",
  ],
  [
    "значения R и C",
    " устанавливаются",
    " на магазине сопротивлений и емкостей в процессе выполнения работы.",
  ],
  [
    "значение δу",
    "определяется",
    "по положению указателя на переключателе чувствительности(«В/дел»), расположенному на передней панели осциллографа.",
  ],
  ["значение δX", "указано", "на установке."],
  [
    "осциллограф",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/с1-65а.png'/>",
  ],
  [
    "амперметр",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/ammeter.jpg'/>",
  ],
  [
    "ЛАТР",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/latr2.jpg'/>",
  ],
  ["ЛАТР", "расшифровывается", "как лабораторный автотрансформатор'/>"],
  [
    "тороид",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/torus.jpg'/>",
  ],
  [
    "магазин сопротивлений",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/resistance.jpg'/>",
  ],
  [
    "магазин емкостей",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/capacitor.jpg'/>",
  ],
  [
    "принципиальная схема уставноки",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/sceme.jpg'/>",
  ],
  [
    "зависимость J от B",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/main_curve_b.jpg'/>",
  ],
  [
    "петля гистерезиса",
    "выглядит",
    "как показано на рисунке <br><img class='question-img' src='..//assets/img/hysteresis.jpg'/>",
  ],
];

let endings = [
  ["ет", "(ет|ут|ют)"],
  ["ут", "(ет|ут|ют)"],
  ["ют", "(ет|ут|ют)"], //1 спряжение

  ["ит", "(ит|ат|ят)"],
  ["ат", "(ит|ат|ят)"],
  ["ят", "(ит|ат|ят)"], //2 спряжение

  ["ется", "(ет|ут|ют)ся"],
  ["утся", "(ет|ут|ют|ующие)ся"],
  ["ются", "(ет|ут|ют)ся"], //1 спряжение, возвратные

  ["ится", "(ит|ат|ят)ся"],
  ["атся", "(ит|ат|ят)ся"],
  ["ятся", "(ит|ат|ят)ся"], //2 спряжение, возвратные

  ["ящие", "ящие"],
  ["ee", "ee"],
  ["ен", "ен"],
  ["ую", "ая"],
  ["му", "ма"],
  ["ена", "ена"],
  ["ено", "ено"],
  ["ены", "ены"], //краткие прилагательные

  ["ан", "ан"],
  ["ая", "ую"],
  ["ана", "ана"],
  ["ано", "ано"],
  ["аны", "аны"], //краткие прилагательные

  ["но", "но"],
  ["на", "на"],

  ["жен", "жен"],
  ["жна", "жна"],
  ["жно", "жно"],
  ["жны", "жны"],

  ["такое", "- это"],
];

let blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"];

function getEndingIndex(word) {
  //проверка слова на совпадение по черному списку в массиве blacklist
  if (blacklist.indexOf(word) !== -1) return -1;

  for (let i = 0; i < endings.length; i++)
    if (word.substring(word.length - endings[i][0].length) == endings[i][0])
      return i;

  return -1;
}

function firstSymbolToLowerCase(str) {
  return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function firstSymbolToUpperCase(str) {
  return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question) {
  //преобразование текста из параметра функции question
  //чтобы сделать первую букву в тексте вопроса прописной
  let text = firstSymbolToLowerCase(question);
  //знаки препинания
  let separators = "'\",.!?()[]\\/";
  //добавление пробелов перед знаками препинания
  for (let i = 0; i < separators.length; i++)
    text = text.replace(separators[i], " " + separators[i]);

  //массив слов и знаков препинания, отделенных пробелами
  let words = text.split(" ");

  //перебор слов в массиве слов из вопроса
  for (let i = 0; i < words.length; i++)
    words[i] = firstSymbolToLowerCase(words[i]);

  let result = false;
  let answer = "";

  for (let i = 0; i < words.length; i++) {
    let ending = getEndingIndex(words[i]);

    if (ending >= 0) {
      words[i] =
        words[i].substring(0, words[i].length - endings[ending][0].length) +
        endings[ending][1];

      console.log(words);

      //создание регулярного выражения для поиска по сказуемому из вопроса
      let predicate = new RegExp(".*" + words[i] + ".*");

      //для кратких прилагательных нужно захватить следующее за найденным слово
      if (endings[ending][0] == endings[ending][1]) {
        if (words[i] != "нужен") {
          predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");
          i++;
        }
      }
      console.log(predicate);

      //создание регулярного выражения для поиска по подлежащему из вопроса
      let subjectReg = words.slice(i + 1).join(".*");
      console.log(subjectReg);

      //только если в подлежащем больше трех символов
      if (subjectReg.length > 3) {
        let subject = new RegExp(".*" + subjectReg + ".*");
        console.log(subject);

        //поиск совпадений с шаблонами среди связей семантической сети
        for (let j = 0; j < knowledge.length; j++) {
          if (
            predicate.test(knowledge[j][1].toLowerCase()) &&
            (subject.test(knowledge[j][0].toLowerCase()) ||
              subject.test(knowledge[j][2].toLowerCase()))
          ) {
            //создание простого предложения из семантической связи
            answer += firstSymbolToUpperCase(
              knowledge[j][0] +
                " " +
                knowledge[j][1] +
                " " +
                knowledge[j][2] +
                "<br>"
            );
            result = true;
          }
        }

        //если совпадений с двумя шаблонами нет,
        if (!result) {
          //поиск совпадений только с шаблоном подлежащего
          for (let j = 0; j < knowledge.length; j++) {
            if (
              subject.test(
                knowledge[j][0].toLowerCase() ||
                  subject.test(knowledge[j][2].toLowerCase())
              )
            ) {
              //создание простого предложения из семантической связи
              answer += firstSymbolToUpperCase(
                knowledge[j][0] +
                  " " +
                  knowledge[j][1] +
                  " " +
                  knowledge[j][2] +
                  "<br>"
              );
              result = true;
              break;
            }
          }
        }
      }
    }
  }
  //если ответа нет
  if (!result) answer = "Ответ не найден. <br/>";
  return answer;
}
