/*3. Разработать XML-документ, содержащий данные о трех новых учебных дисциплинах, которые следует добавить в таблицу SUBJECT. 
Разработать сценарий, извлекающий данные о дисциплинах из XML-документа и добавля-ющий их в таблицу SUBJECT. 
При этом применить системную функцию OPENXML и конструкцию INSERT… SELECT. 
*/
--------------------------------------
---------------UNIVER-----------------
--------------------------------------
USE UNIVER
GO
DECLARE @H INT = 0,
@SBJ VARCHAR(3000) = '<?xml version="1.0" encoding="windows-1251" ?>
                      <ДИСЦИПЛИНЫ>
					     <ДИСЦИПЛИНА КОД="КСИССИ" НАЗВАНИЕ="КСИС МИРОНОВ" КАФЕДРА="ИСИТ" />
						 <ДИСЦИПЛИНА КОД="ОЗИA" НАЗВАНИЕ="ОСНОВЫ ЗАЩИТЫ ИНФОРМАЦИИ" КАФЕДРА="ИСИТ" />
						 <ДИСЦИПЛИНА КОД="ТЕРВЕР" НАЗВАНИЕ="ТЕР ВЕР" КАФЕДРА="ИСИТ" />
					  </ДИСЦИПЛИНЫ>';
EXEC SP_XML_PREPAREDOCUMENT @H OUTPUT, @SBJ;
INSERT SUBJECT SELECT[КОД], [НАЗВАНИЕ], [КАФЕДРА] FROM OPENXML(@H, '/ДИСЦИПЛИНЫ/ДИСЦИПЛИНА',0)
    WITH([КОД] CHAR(10), [НАЗВАНИЕ] VARCHAR(100), [КАФЕДРА] CHAR(20))		;

SELECT * FROM SUBJECT WHERE PULPIT = 'ИСИТ'

EXEC SP_XML_REMOVEDOCUMENT @H;                          

--------------------------------------
-----------------BANK-----------------
--------------------------------------
USE BANK;
GO
DECLARE @H INT = 0,
@SBJ VARCHAR(3000) =  '<?xml version="1.0" encoding="windows-1251" ?>
                      <БАНКИ>
					     <БАНК ID="6" НАЗААНИЕ_КРЕДИТА="ТИНКОФФ" СТАВКА="100" />
						 <БАНК ID="7" НАЗААНИЕ_КРЕДИТА="БЕЛАРУСБАНК" СТАВКА="200" />
						 <БАНК ID="8" НАЗААНИЕ_КРЕДИТА="СБЕРБАНК" СТАВКА="300" />
					  </БАНКИ>';
EXEC SP_XML_PREPAREDOCUMENT @H OUTPUT, @SBJ;
INSERT БАНК SELECT[ID], [НАЗААНИЕ_КРЕДИТА], [СТАВКА] FROM OPENXML(@H, '/БАНКИ/БАНК',0)
    WITH([ID] INT, [НАЗААНИЕ_КРЕДИТА] VARCHAR(100), [СТАВКА] INT);
EXEC SP_XML_REMOVEDOCUMENT @H;                          
SELECT *FROM  БАНК

