/*4. хяонкэгсъ рюакхжс STUDENT пюгпюан-рюрэ XML-ярпсйрспс, яндепфюысч оюяонпрмше дюммше ярсдемрю: яепхч х мнлеп оюяонпрю, кхв-мши мнлеп, дюрю бшдювх х юдпея опнохяйх. 
пюгпюанрюрэ яжемюпхи, б йнрнпши бйкчвем ноепюрнп INSERT, днаюбкъчыхи ярпнйс я XML-ярнкажнл.
бйкчвхрэ б щрнр фе яжемюпхи ноепюрнп UP-DATE, хглемъчыхи ярнкаеж INFO с ндмни ярпнйх рюакхжш STUDENT х ноепюрнп SELECT, тнплхпсчыхи пегскэрхпсчыхи мюанп, юмюкнцхвмши опедярюбкеммнлс мю пх-ясмйе. 
б SELECT-гюопняе хяонкэгнбюрэ лерндш QUERY х VALUEXML-рхою.
*/

--------------------------------------
---------------UNIVER-----------------
--------------------------------------
USE  UNIVER;
GO
INSERT INTO STUDENT(IDGROUP, NAME, BDAY, INFO)
VALUES(4, 'йнпемвсй ю.б.', '2001-10-15',
	'<ярсдемр>
		<оюяонпр яепхъ="цп" мнлеп="4133033" дюрю="2013-04-19" />
		<рекетнм>+375291247723</рекетнм>
		<юдпея>
			<ярпюмю>аекюпсяэ</ярпюмю>
			<цнпнд>унимхйх</цнпнд>
			<скхжю>кеплнмрнбю</скхжю>
			<днл>18</днл>
			<йбюпрхпю>36</йбюпрхпю>
		</юдпея>
	</ярсдемр>');
GO
SELECT * FROM STUDENT WHERE NAME = 'йнпемвсй ю.б.'
GO
UPDATE STUDENT SET INFO = 
	'<ярсдемр>
		<оюяонпр яепхъ="цп" мнлеп="4133033" дюрю="19.04.2013" />
		<рекетнм>+375291234567</рекетнм>
		<юдпея>
			<ярпюмю>аекюпсяэ</ярпюмю>
			<цнпнд>цнлекэ</цнпнд>
			<скхжю>янберяйюъ</скхжю>
			<днл>10</днл>
			<йбюпрхпю>10</йбюпрхпю>
		</юдпея>
	</ярсдемр>' WHERE NAME='йнпемвсй ю.б.'; 
GO
SELECT NAME[тхн], INFO.value('(ярсдемр/оюяонпр/@яепхъ)[1]', 'CHAR(2)')[яепхъ оюяонпрю],
	INFO.value('(ярсдемр/оюяонпр/@мнлеп)[1]', 'VARCHAR(20)')[мнлеп оюяонпрю],
	INFO.query('/ярсдемр/юдпея')[юдпея]
		FROM  STUDENT
			WHERE NAME = 'йнпемвсй ю.б.';  


			
--------------------------------------
-----------------BANK-----------------
--------------------------------------